content/daily/2022-05-04.md
+++
title = "2022-05-04"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## INT104 tutorial {#int104-tutorial}


### report requirement {#report-requirement}


#### basic {#basic}

in the format specifications.

<!--list-separator-->

-  page limit

<!--list-separator-->

-  format


#### tasks {#tasks}

write following for each task:

<!--list-separator-->

-  task1

<!--list-separator-->

-  task2

<!--list-separator-->

-  task3


## regarding the template {#regarding-the-template}


### control org-mode latex export behaviour {#control-org-mode-latex-export-behaviour}


#### settings {#settings}

[this tutorial](https://github.com/Literate-DevOps/literate-programming-tutorials/blob/master/how-to/00-convert-latex-template-into-org-mode-template/how-to-migrate-latex-template-into-org-mode.org#fn.8) helped me with most works.
I haven't checked the examples, but I guess I could just use a modified version of this template

<!--list-separator-->

-  for the environment

    the template would be scanned for both in the location output mentioned and the current directory (./), so just placing the template files in the same directory as the .tex files would make it work.

<!--list-separator-->

-  file variables

    have to reload the file variables with `M-x normal-mode`.

<!--list-separator-->

-  errors

    <!--list-separator-->

    -  1. not finding the class epj-svjour

        not loading the file variables
        solution: reload with  `M-x normal-mode`.

    <!--list-separator-->

    -  2. no author, titles, abstracts, reference...

        this is due to `#+CALL: export-epj-latex-block()` not being executed

        adding latex to babel languages make it work. not knowing why.